src/test/projects/depgraph-maven-plugin-test/expectations/by-groupid_module-2.dot
digraph "module-2" {
  node [shape="box",style="rounded",fontname="Helvetica",fontsize="14"]
  edge [fontsize="10",fontname="Helvetica"]

  // Node Definitions:
  "com.github.ferstl:compile"[label=<<font point-size="14">com.github.ferstl</font>>]
  "com.google.guava:compile"[label=<<font point-size="14">com.google.guava</font>>]
  "commons-codec:compile"[label=<<font point-size="14">commons-codec</font>>]
  "org.apache.commons:compile"[label=<<font point-size="14">org.apache.commons</font>>]
  "org.springframework:compile"[label=<<font point-size="14">org.springframework</font>>]
  "junit:test"[label=<<font point-size="14">junit</font><font point-size="10"><br/>(test)</font>>]
  "org.hamcrest:test"[label=<<font point-size="14">org.hamcrest</font><font point-size="10"><br/>(test)</font>>]

  // Edge Definitions:
  "com.github.ferstl:compile" -> "com.google.guava:compile"
  "com.github.ferstl:compile" -> "commons-codec:compile"
  "com.github.ferstl:compile" -> "org.apache.commons:compile"
  "com.github.ferstl:compile" -> "org.springframework:compile"
  "junit:test" -> "org.hamcrest:test"
  "com.github.ferstl:compile" -> "junit:test"
}
